[
  {
    "path": "posts/welcome/",
    "title": "A (Not Entirely Novel) Problem with No Definitive Solutions",
    "description": "How can we extract meaningful information from a corpora of Renaissance texts using topic modeling?",
    "author": [
      {
        "name": "Cassidy All",
        "url": {}
      }
    ],
    "date": "2023-09-27",
    "categories": [],
    "contents": "\n\nContents\nIntroduction\nMetaphors, Irony, and Context\nOur Corpus\n“Wishlist” for topic models\nBetter Evaluation\n\nResearch Directions\nSpecific Work\nBroad Contributions\n\n\nIntroduction\nDigital humanities work promises researchers access to unthinkably large corpora spanning upwards of 278,000 books [1] and 300 billion words [2]. Computer scientists have effectively used these corpora to train increasingly-powerful Artificial Intelligence (AI) models. However, many of the insights in these corpora remain inscrutable to human researchers.\nBlei [3] and others have described some of the valuable research which can arise from corpora-level analysis centered in the humanities. Corpora-level analysis allows researchers to examine the evolution of texts over time; search for specific topics; understand the influence of authorship; provenance; and other non-contextual features on literature’s themes, and more.\nA major tool in doing this digital humanities work is topic modeling1, however, its difficulty represents a major stumbling block for new and experienced scholars alike. Broadly, we consider the motivations of topic modeling, adapted from [4], to be:\nOrganizing documents into thematic categories\nDesigning categories with appropriate levels of granularity and abstractness\nDescribing the evolution of those categories over time\nEnabling a domain expert to analyze and understand the content\nFinding relationships between categories\nUnderstanding how authorship, origin, and other contextual features influence content\nMetaphors, Irony, and Context\nCorpora of historical literature share much of the same problem space as more modern corpora, however, they also present unique challenges.\nOur Corpus\nTo explore race and politics in Renaissance literature—as well as develop new methods in the digital humanities—we are utilizing the Visualizing English Print corpus with standardized spellings generated from texts released by the Text Creation Partnership as part of the Early English Books Online corpus.\nIt contains ____ from ___ to ___ and ___ unique words. Explore some of the collection’s metadata below.\n\n\n\n\n“Wishlist” for topic models\nChoosing an optimal number (K) of topics\nCoherent, distinct, and, non-ambiguous topics\nReasonable compute time for mid-size(?) corpora\nContextual understandings of KWIC\nBetter Evaluation\nWhat’s going on?\nResearch Directions\nSpecific Work\nProduce ground truth corpus\nUnderstand race, politics over time\nBroad Contributions\nConduct a comprehensive review of major research directions in topic modeling as they apply to the analysis of historical corpora\nDesign and evaluate ensemble models\nExplore and design evaluation metrics from multistakeholder perspectives\nImprove the computational efficiency of the Top2Vec library\nContribute to TopModel, OCTIS, and other topic modeling frameworks\nDevelop new models and a set of best practices for understanding metaphor, irony, and other context-dependent phrases\n\n\n\n[1] L. Gao et al., “The Pile: An 800GB Dataset of Diverse Text for Language Modeling.” arXiv, Dec. 2020. doi: 10.48550/arXiv.2101.00027.\n\n\n[2] Y. Goldberg and J. Orwant, “A Dataset of Syntactic-Ngrams over Time from a Very Large Corpus of English Books,” in Second Joint Conference on Lexical and Computational Semantics (*SEM), Volume 1: Proceedings of the Main Conference and the Shared Task: Semantic Textual Similarity, Atlanta, Georgia, USA: Association for Computational Linguistics, Jun. 2013, pp. 241–247. Accessed: Sep. 28, 2023. [Online]. Available: https://aclanthology.org/S13-1035\n\n\n[3] D. Blei, “Topic Modeling and Digital Humanities,” Journal of Digital Humanities, vol. 2, no. 1, 2012, Accessed: Sep. 28, 2023. [Online]. Available: https://journalofdigitalhumanities.org/2-1/topic-modeling-and-digital-humanities-by-david-m-blei/\n\n\n[4] K. Batmanghelich and M. Gormley, “10-708 (CMU) Probabilistic Graphical Models: CRF + Intro to Topic Models.” Boston University, 2018. Accessed: Sep. 28, 2023. [Online]. Available: https://www.batman-lab.com/teaching/\n\n\nA probabilistic approach to generating groups of words and phrases from a collection of texts↩︎\n",
    "preview": {},
    "last_modified": "2023-09-28T10:56:19-06:00",
    "input_file": "welcome.knit.md"
  }
]
